Revit 2024 API
FabricationService.Abbreviation Property
 The short name of service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string Abbreviation { get; }
Visual Basic
Public ReadOnly Property Abbreviation As String
	Get
Visual C++
public:
property String^ Abbreviation {
	String^ get ();
}
See Also
FabricationService Class
Autodesk.Revit.DB Namespace